routes/web.php

    ]);
});

Route::get('/artikel', function () {
    return view('artikel', [
        "title" => "Semua Artikel",
        "artikel" => Artikel::latest()->filtercoy()->paginate(10)->withQueryString(),
    ]);
});
---
SELECT * FROM `artikels` ORDER BY `created_at` DESC LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `artikels`

});

Route::get('/dashboard', function () {
    return view('dashboard.index', [
        "produk" => Produk::all(),
        "kategori" => Kategori::all(),
        "user" => User::all(),
        "artikel" => Artikel::all()
    ]);
---
SELECT * FROM `kategoris`
SELECT * FROM `produks`
SELECT * FROM `users`
SELECT * FROM `artikels`

Route::resource('/dashboard/artikel', ArtikelController::class)->middleware(['auth']);

// Route untuk data page
Route::get('/dashboard/data', function () {
    return view('dashboard.data', [
        'data' => User::all()
    ]);
})->middleware(['auth', 'admin']);
---
SELECT * FROM `users`


// Route ke Semua category
Route::get('/categories', function () {
    return view('kategoripost', [
        "title" => 'All Categories',
        "categories" => KategoriArtikel::all(),
        "categoriproduk" => Kategori::all()
    ]);
---
SELECT * FROM `kategori_artikels`
SELECT * FROM `kategoris`