app/Http/Controllers/AdminKategoriController.php

    public function index()
    {

        return view('dashboard.kategori.index', [
            'kategori' => Kategori::all()
        ]);
---
SELECT * FROM `kategoris`