app/Http/Controllers/ArtikelController.php

SELECT * FROM `artikels` WHERE `user_id` = 6 ORDER BY `created_at` DESC LIMIT 10 offset 0
SELECT * FROM `users` WHERE `users`.`id` in (6)
SELECT count(*) as aggregate FROM `artikels` WHERE `user_id` = 6
---
    public function index()
    {
        return view('dashboard.artikel.index', [
            'dataArtikel' => Artikel::where('user_id', auth()->user()->id)
                ->latest()
                ->paginate(10)
                ->withQueryString()
        ]);

SELECT * FROM `artikels` ORDER BY `artikels`.`created_at` DESC LIMIT 10 offset 10
SELECT count(*) as aggregate FROM `artikels`
---
    public function allartikel()
    {
        return view('dashboard.artikel.allartikel', [
            'dataArtikel' => Artikel::latest()
                ->paginate(10)
                ->withQueryString()
        ]);