app/Http/Controllers/DashboardController.php

SELECT * FROM `kategoris` WHERE `kategoris`.`id` in (1)
SELECT * FROM `produks` ORDER BY `produks`.`created_at` DESC LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `produks`
---
    public function index()
    {
        // dd(request('search'));

        return view('dashboard.produk.index', [
            "produk" =>  Produk::latest('produks.created_at')->filter(request(['search', 'kategori']))->paginate(10)->withQueryString(),
        ]);

SELECT * FROM `produk_variasis` WHERE `produk_id` = 1
SELECT * FROM `produks` WHERE `produks`.`id` in (1)
---
    public function show(Produk $produk)
    {
        $produkVariasi = Produk_Variasi::where('produk_id', $produk->id)
            ->with(['produk', 'warna', 'ukuran', 'gambar']) // Memuat relasi terkait
            ->get();

SELECT * FROM `kategoris`
SELECT * FROM `variasi_warnas`
SELECT * FROM `variasi_gambars`
SELECT * FROM `variasi_ukurans`
---
    public function edit(Produk $produk)
    {
        $variasi = $produk->variasi()->with(['warna', 'ukuran'])->get();

        // Cek apakah variasi punya harga berbeda
        $adaHargaBerbeda = $variasi->pluck('harga')->unique()->count() > 1;

        return view('dashboard.produk.edit', [
            "produk" => $produk,
            "kategori" => Kategori::all(),
            "warnas" => Variasi_Warna::all(),
            "gambars" => Variasi_Gambar::all(),
            "ukurans" => Variasi_Ukuran::all(),
            'adaHargaBerbeda' => $adaHargaBerbeda,

        ]);

DELETE FROM `produks` WHERE `id` = 139
---
        foreach ($gambarFields as $field) {
            if ($request->file($field)) {
                if ($produk->$field) {
                    Storage::delete($produk->$field);