app/Http/Controllers/DataBarangController.php

    public function index(Request $request)
    {
        $query = Produk::query();

        // Pencarian berdasarkan nama produk
        if ($request->has('search')) {
            $query->where('nama_produk', 'like', '%' . $request->search . '%');
        }

        // Filter berdasarkan kategori
        if ($request->has('kategori') && $request->kategori != '') {
            $query->where('kategori_id', $request->kategori);
        }

        $produk = $query->with('variasi', 'kategori')->get();
---
SELECT * FROM `kategoris` WHERE `kategoris`.`id` in (1, 2, 3, 4)
SELECT * FROM `produks` WHERE `produks`.`id` in (1, 3, 4, 5, 6, 7, 8, 11)