app/Http/Controllers/DataBarangController.php

    public function index()
    {
        $produk = Produk::with(['variasi.warna', 'variasi.ukuran'])->paginate(10);
---
SELECT * FROM `produks` LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `produks`