app/Http/Controllers/KategoriArtikelController.php

    public function index()
    {
        return view('dashboard.kategoripost.index', [
            'kategori' => KategoriArtikel::all()
        ]);
---
SELECT * FROM `kategori_artikels`