app/Http/Controllers/KategoriController.php

SELECT * FROM `kategoris` WHERE `kategoris`.`id` in (2)
SELECT * FROM `produks` WHERE `produks`.`kategori_id` = 2 and `produks`.`kategori_id` IS not NULL ORDER BY `created_at` DESC LIMIT 12 offset 0
SELECT count(*) as aggregate FROM `produks` WHERE `produks`.`kategori_id` = 2 and `produks`.`kategori_id` IS not NULL
SELECT * FROM `kategoris`
---
    public function index(Kategori $kategori)
    {
        return view('produk', [
            "title" => 'Kategori: ' . ucwords($kategori->nama),
            "posts" => $kategori->produk()->latest()->filter(request(['search']))->paginate(12)->withQueryString(), // Filter produk berdasarkan kategori
            "kategori" => Kategori::all(),