app/Http/Controllers/ProdukController.php

    public function index()
    {
        return view('produk', [
            "title" => "Semua Produk",
            "posts" => Produk::with(['kategori', 'variasi'])->latest()->filter(request(['search', 'kategori']))->paginate(10)->withQueryString(),
            "kategori" => Kategori::all()
        ]);
---
SELECT * FROM `kategoris` WHERE `kategoris`.`id` in (1)
SELECT * FROM `produks` WHERE `produks`.`id` in (127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138)
SELECT count(*) as aggregate FROM `produks`
SELECT * FROM `kategoris`

    public function show(Produk $produkid)
    {

        $produkVariasi = Produk_Variasi::where('produk_id', $produkid->id)
            ->with(['produk', 'warna', 'ukuran', 'gambar']) // Memuat relasi terkait
            ->get();
---
SELECT * FROM `produk_variasis` WHERE `produk_id` = 136
SELECT * FROM `produks` WHERE `produks`.`id` in (136)